Repository: SurniaUlula/wpsso-user-locale
Catalog: languages/wpsso-user-locale-*.po
Languages: fr_fr

# lib file description
source: User Locale
fr_fr: Langue utilisateur

# plugin description
source: WPSSO Core extension to add a user locale / language / region selector in the WordPress admin back-end and front-end toolbar menus.
fr_fr: Extension WPSSO Core pour ajouté un sélecteur de langue / région pour les utilisateurs dans la barre d'outils WordPress d'avant et arrière.

source: An icon to prefix the title string used in the WordPress toolbar menu (uses the "translation" icon by default). Select "[None]" to disable the toolbar menu icon.
fr_fr: Un icône devant le titre utilisé dans le menu de barre d'outils WordPress (utilise l'icône de "traduction" par défaut). Sélectionnez "[Aucun]" pour désactiver l'utilisation d'un icône dans de menu de barre d'outils.

source: The title string used in the WordPress toolbar menu. The "%s" parameter is replaced by the current user locale value (example: "User Locale (%s)").
fr_fr: Le titre utilisé dans le menu de barre d'outils WordPress. Le paramètre "%s" est remplacé par la valeur actuel de la langue utilisateur (exemple: "Langue utilisateur (%s)").

source: Add the user locale selector to the front-end toolbar menu, and define current WordPress locale as the user locale value.
fr_fr: Ajouter le sélecteur de langue utilisateur dans le menu de barre d'outils d'avant, et définir la langue courante WordPress comme celle de la langue utilisateur.

# toolbar menu title
source: default
fr_fr: défaut

# toolbar menu item
source: Default Locale
fr_fr: Langue par défaut

# metabox title
source: User Locale Settings
fr_fr: Réglages langue utilisateur

# option label
source: Toolbar Menu Icon
fr_fr: Icône dans la barre d'outils

# option label
source: Toolbar Menu Title
fr_fr: Titre dans la barre d'outils

# option label
source: Add User Locale on Front-End
fr_fr: Ajouter langue utilisateur à l'avant

source: %1$s is an extension for the %2$s plugin &mdash; please install and activate the %3$s plugin before activating %4$s.
fr_fr: %1$s est une extension pour %2$s &mdash; s'il vous plaît installer et activer %3$s avant d'activer l'extension %4$s.

source: The %1$s extension requires the %2$s plugin &mdash; install and activate the %3$s plugin or <a href="%4$s">deactivate the %5$s extension</a>.
fr_fr: L'extension %1$s requiert %2$s &mdash; installer et activer %3$s ou <a href="%4$s">désactiver l'extension %5$s</a>.

source: %1$s requires %2$s version %3$s or higher and has been deactivated.
fr_fr: %1$s nécessite %2$s version %3$s ou supérieure et a été désactivé.

source: Please upgrade %1$s before trying to re-activate the %2$s plugin.
fr_fr: Veuillez mettre à jour %1$s avant d'essayer de réactiver l'extension %2$s.

source: The %1$s version %2$s extension requires %3$s version %4$s or newer (version %5$s is currently installed).
fr_fr: L'extension %1$s version %2$s requiert %3$s version %4$s ou plus récente (version %5$s est actuellement installée).

source: %s warning:
fr_fr: Alerte %s:

source: WPSSO Core extension to add a user locale / language / region selector in the WordPress admin back-end and front-end toolbar menus.
fr_fr: Extension WPSSO Core pour ajouté un sélecteur de langue / région pour les utilisateurs dans la barre d'outils WordPress d'avant et arrière.
